hull_opt_core8/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

backgroundMesh
{
    xMin     -15.688984394073486;
    xMax     12.551187515258789;
    yMin     -8.585050106048584;
    yMax     8.585050106048584;
    zMin     -16.0;
    zMid1    -1.0;
    zMid2     0.188;
    zMid3     0.244;
    zMid4     0.3;
    zMid5     1.6;
    zMax      4.57857608795166;

    /*xCells   42;
    yCells   19;

    zCells1  10;
    zCells2  8;
    zCells3  32;
    zCells4  48;
    zCells5  40;
    zCells6  8;
    */

    xCells   56;
    yCells   34;

    zCells1  43;
    zCells2  43;
    zCells3  4;
    zCells4  4;
    zCells5  43 * (40/50);
    zCells6  43 * (20/50);
}

vertices
(
    (-15.688984394073486 -8.585050106048584 -17.169660329818726) // 0
    (12.551187515258789 -8.585050106048584 -17.169660329818726) // 1
    (12.551187515258789 8.585050106048584 -17.169660329818726) // 2
    (-15.688984394073486 8.585050106048584 -17.169660329818726) // 3

    (-15.688984394073486 -8.585050106048584 -5.150898098945618) // 4
    (12.551187515258789 -8.585050106048584 -5.150898098945618) // 5
    (12.551187515258789 8.585050106048584 -5.150898098945618) // 6
    (-15.688984394073486 8.585050106048584 -5.150898098945618) // 7

    (-15.688984394073486 -8.585050106048584 -1.0301796197891235) // 8
    (12.551187515258789 -8.585050106048584 -1.0301796197891235) // 9
    (12.551187515258789 8.585050106048584 -1.0301796197891235) // 10
    (-15.688984394073486 8.585050106048584 -1.0301796197891235) // 11

    (-15.688984394073486 -8.585050106048584 -0.10301796197891236) // 12
    (12.551187515258789 -8.585050106048584 -0.10301796197891236) // 13
    (12.551187515258789 8.585050106048584 -0.10301796197891236) // 14
    (-15.688984394073486 8.585050106048584 -0.10301796197891236) // 15

    (-15.688984394073486 -8.585050106048584 0.1) // 16
    (12.551187515258789 -8.585050106048584 0.1) // 17
    (12.551187515258789 8.585050106048584 0.1) // 18
    (-15.688984394073486 8.585050106048584 0.1) // 19

    (-15.688984394073486 -8.585050106048584 2.28928804397583) // 20
    (12.551187515258789 -8.585050106048584 2.28928804397583) // 21
    (12.551187515258789 8.585050106048584 2.28928804397583) // 22
    (-15.688984394073486 8.585050106048584 2.28928804397583) // 23

    (-15.688984394073486 -8.585050106048584 4.57857608795166) // 24
    (12.551187515258789 -8.585050106048584 4.57857608795166) // 25
    (12.551187515258789 8.585050106048584 4.57857608795166) // 26
    (-15.688984394073486 8.585050106048584 4.57857608795166) // 27

);

blocks
(
    // Block 1
    hex (0 1 2 3 4 5 6 7) 
    (
        56
        34
        8
    ) 
    simpleGrading (1 1 0.05)
    
    // Block 2
    hex (4 5 6 7 8 9 10 11) 
    (
        56
        34
        8
    ) 
    simpleGrading (1 1 1)
    
    // Block 3
    hex (8 9 10 11 12 13 14 15) 
    (
        56
        34
        35
    ) 
    simpleGrading (1 1 1)
    
    // Block 4
    hex (12 13 14 15 16 17 18 19) 
    (
        56
        34
        43
    ) 
    simpleGrading (1 1 1)
    
    // Block 6
    hex (16 17 18 19 20 21 22 23) 
    (
        56
        34
        43
    ) 
    simpleGrading (1 1 1)
    
    // Block 7
    hex (20 21 22 23 24 25 26 27) 
    (
        56
        34
        8
    ) 
    simpleGrading (1 1 5)
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    // midPlane
    // {
    //     type symmetryPlane;
    //     faces
    //     (
    //         (3 7 6 2)
    //         (7 11 10 6)
    //         (11 15 14 10)
    //         (15 19 18 14)
    //         (19 23 22 18)
    //         (23 27 26 22)
    //     );
    // }
);


// ************************************************************************* //
