hull_opt_core8/system/functions
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  12
     \/     M anipulation  |
*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
    type            forces;
    libs            ("libforces.so");
    patches         (hull);
    log             on;
    writeControl    timeStep;
    writeInterval   1;

    // Centre of rotation for moment calculations
    CofR            (2.830205329058419 4.490321927098085e-08 0.31810309088071);
}

// ************************************************************************* //
